[
  {
    "title": "The Game as a Classroom: Understanding Players’ Goals and Attributions from a Learning Perspective",
    "citation": "<strong>Martin, W.</strong>, & Magerko, B. (2020, September). The Game as a Classroom: Understanding Players’ Goals and Attributions from a Learning Perspective. In <em>International Conference on the Foundations of Digital Games</em> (pp. 1-4).",
    "abstract": "Much work has been done on educational games, game-based learning, and gamification in recent years, exploring how games may benefit learning. However, the reverse relationship has yet to be fully explored—how can educational psychology and pedagogy influence our understanding of player experience and the design of games? A study was conducted to examine how various aspects of player experience are related to two commonly used motivational constructs in educational psychology: achievement goals and causal attributions. In the study, 165 participants were asked to play a game and fill out a questionnaire on their experiences. We found that players’ achievement goals and causal attributions were both significantly correlated to various components of player experience. Additionally, we found that achievement goals and causal attributions are significant predictors of psychological flow over and above feelings of challenge and immersion. While challenge and immersion are typical considerations when seeking to design flow experiences in games, this study suggests that game designers should also consider ways in which they may inspire particular achievement goals and causal attributions in their players. These findings highlight the connection between the learning sciences and the growing field of player experience, and we hope this paper serves as an example for future translational work.",
    "DOI": "",
    "PDF": "",
    "video": "https://youtu.be/i_Cr264tQpk?t=1679"
  },
  {
    "title": "Out of tune: discord and learning in a music programming museum exhibit",
    "citation": "Long, D., McKlin, T., Weisling, A., <strong>Martin, W.</strong>, Blough, S., Voravong, K., & Magerko, B. (2020, June). Out of tune: discord and learning in a music programming museum exhibit. In <em>Proceedings of the Interaction Design and Children Conference</em> (pp. 75-86).",
    "abstract": "Museum visitors often come into the museum space receptive to exploring new ideas, and this may encourage members of visitor groups to be supportive and cooperative when engaging together with exhibits. However, as participant groups explore the concepts of the exhibit, interruptions, conflicts, or disagreements may result. We collectively label this social tension as discord. This paper studies discord among family groups interacting with TuneTable, a museum exhibit designed to promote middle school students' interest in and learning of basic computing concepts (e.g. loops, conditionals) through music programming. We analyzed video recordings of each participant group and found that discord often appears alongside three markers of high engagement: a) complex physical manipulation of exhibit components; b) conversation demonstrating an in-depth understanding of how the exhibit works; and c) instances of collaboration between group members. Our findings suggest that certain types of discord could potentially be indicators of productive learning experiences at museum exhibits related to computing. In addition, when designing informal learning experiences for computing education, our findings suggest that discord is a potential trigger for deeper engagement that warrants further exploration.",
    "DOI": "",
    "PDF": ""
  },
  {
    "title": "Trajectories of physical engagement and expression in a co-creative museum installation",
    "citation": "Long, D., McKlin, T., Weisling, A., <strong>Martin, W.</strong>, Guthrie, H., & Magerko, B. (2019). Trajectories of physical engagement and expression in a co-creative museum installation. In <em>Proceedings of the 2019 on Creativity and Cognition</em> (pp. 246-257).",
    "abstract": "Co-creative (i.e. collaboratively creative) activities involving physical interaction are becoming more prevalent in museums as a way of promoting opportunities for exploratory learning-through-doing. However, there is still a need for new techniques for understanding how physical interaction relates to engagement and creative expression in order to both evaluate exhibits and iterate on their design. This article reports on a study of how family groups physically interact in a museum environment with a specific co-creative exhibit--TuneTable. We relate observable markers of physical interaction with stages of engagement/expression based in the literature and identify several different trajectories of participant engagement and creative expression as they navigate the exhibit. We explore what these trajectories tell us about the types of inquiry and experimentation that TuneTable supports and discuss design implications. This paper's main contribution is a deep study of how physical markers reveal trajectories of creative engagement within a specific co-creative installation.",
    "DOI": "https://doi.org/10.1145/3325480.3325505",
    "PDF": "/files/trajectoriesOfPhysicalEngagement_LongEtAl.pdf"
  }
]